console.log("\x1b[1;30;46mСпасибо за проверку моей работы! Хорошего дня! ")

console.log(`\x1b[32m1. Task: https://github.com/rolling-scopes-school/tasks/blob/master/tasks/shelter/shelter-part2.md
  2. Deploy: https://rolling-scopes-school.github.io/jnuka-JSFEPRESCHOOL2024Q2/shelter/pages/main/
  3. Done 12.07.2024 / deadline 12.08.2024
  4. Score: 100 / 100`);

console.log(`\x1b[1;32m[x] Вёрстка страницы Main соответствует макету при ширине экрана 1280px: +14\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Not only: +2
    [x] блок About: +2
    [x] блок Our Friends: +2
    [x] блок Help: +2
    [x] блок In addition: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Вёрстка страницы Main соответствует макету при ширине экрана 768px: +14\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Not only: +2
    [x] блок About: +2
    [x] блок Our Friends: +2
    [x] блок Help: +2
    [x] блок In addition: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Вёрстка страницы Main соответствует макету при ширине экрана 320px: +14\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Not only: +2
    [x] блок About: +2
    [x] блок Our Friends: +2
    [x] блок Help: +2
    [x] блок In addition: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +6\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Our Friends: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +6\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Our Friends: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +6\x1b[0;34m
    [x] блок <header>: +2
    [x] блок Our Friends: +2
    [x] блок <footer>: +2
\x1b[1;32m[x] Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20\x1b[0;34m
    [x] нет полосы прокрутки при ширине страницы Main от 1280рх до 768рх: +5
    [x] нет полосы прокрутки при ширине страницы Main от 768рх до 320рх: +5
    [x] нет полосы прокрутки при ширине страницы Pets от 1280рх до 768рх: +5
    [x] нет полосы прокрутки при ширине страницы Pets от 768рх до 320рх: +5
\x1b[1;32m[x] Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции (Примеры неправильной и правильной реализации): +8\x1b[0;34m
    [x] на странице Main: +4
    [x] на странице Pets: +4
\x1b[1;32m[x] При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4\x1b[0;34m
    * Открытие меню при клике на иконку бургер-меню на текущем этапе не проверяется
\x1b[1;32m[x] Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ : +8`);